wgtdkp/openthread/examples/platforms/nrf528xx/src/toble.c
    otLogInfoPlat("[BLE] otPlatTobleC1Write(ConnectionId=%d)", peer->mConnHandle);
    retval = sd_ble_gattc_write(peer->mConnHandle, &params);

    if (retval != NRF_SUCCESS)
    {
        otLogWarnPlat("[BLE] sd_ble_gattc_write error: 0x%x", retval);
    }
    else
    {
        // peer->isSubscribing = false;
    }
}

/*******************************************************************************
 * @section Bluetooth Low Energy GATT Server.
 *******************************************************************************/

static otError serviceRegister(const otPlatBleUuid *aUuid, uint16_t *aHandle)
{
    uint32_t   retval;
    ble_uuid_t uuid;

    if (aUuid->mType == OT_BLE_UUID_TYPE_16 &&
        (aUuid->mValue.mUuid16 == UUID_SERVICE_GAP || aUuid->mValue.mUuid16 == UUID_SERVICE_GATT))
    {
        // SoftDevice registers GAP and GATT services by default.
        otEXPECT_ACTION(false, retval = NRF_SUCCESS);
    }

    retval = uuidDecode(&uuid, aUuid);
    otEXPECT(retval == NRF_SUCCESS);

    retval = sd_ble_gatts_service_add(BLE_GATTS_SRVC_TYPE_PRIMARY, &uuid, aHandle);

    if (retval != NRF_SUCCESS)
    {
        otLogWarnPlat("[BLE] sd_ble_gatts_service_add error: 0x%x", retval);
    }

exit:
    return nrf5SdErrorToOtError(retval);
}

static otError characteristicRegister(uint16_t aServiceHandle, otPlatBleGattCharacteristic *aChar, bool aCccd)
{
    uint32_t                 retval;
    uint8_t                  uuid_type = 0;
    ble_uuid_t               uuid;
    ble_uuid128_t            uuid128;
    ble_gatts_char_md_t      charMd;
    ble_gatts_attr_md_t      attrMd;
    ble_gatts_attr_md_t      cccdMd;
    ble_gatts_attr_t         attr;
    ble_gatts_char_handles_t handles;

    otEXPECT_ACTION((aChar->mUuid.mType == OT_BLE_UUID_TYPE_128) && (aChar->mUuid.mValue.mUuid128 != NULL),
                    retval = NRF_ERROR_INVALID_PARAM);

    memcpy(uuid128.uuid128, aChar->mUuid.mValue.mUuid128, OT_BLE_UUID_LENGTH);
    retval = sd_ble_uuid_vs_add(&uuid128, &uuid_type);

    if (retval != NRF_SUCCESS)
    {
        otLogWarnPlat("[BLE] sd_ble_uuid_vs_add error: 0x%x", retval);
        otEXPECT(false);
    }

    retval = uuidDecode(&uuid, &aChar->mUuid);
    otEXPECT(retval == NRF_SUCCESS);

    memset(&charMd, 0, sizeof(ble_gatts_char_md_t));

    if (aChar->mProperties & OT_BLE_CHAR_PROP_READ)
    {
        charMd.char_props.read = 1;
    }

    if (aChar->mProperties & OT_BLE_CHAR_PROP_WRITE)
    {
        charMd.char_props.write = 1;
    }

    if (aChar->mProperties & OT_BLE_CHAR_PROP_NOTIFY)
    {
        charMd.char_props.notify = 1;
    }

    if (aChar->mProperties & OT_BLE_CHAR_PROP_INDICATE)
    {
        charMd.char_props.indicate = 1;
    }

    if (aCccd)
    {
        memset(&cccdMd, 0, sizeof(ble_gatts_attr_md_t));
        BLE_GAP_CONN_SEC_MODE_SET_OPEN(&cccdMd.read_perm);
        BLE_GAP_CONN_SEC_MODE_SET_OPEN(&cccdMd.write_perm);

        cccdMd.vloc      = BLE_GATTS_VLOC_STACK;
        charMd.p_cccd_md = &cccdMd;
    }

    memset(&attrMd, 0, sizeof(ble_gatts_attr_md_t));

    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&attrMd.read_perm);
    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&attrMd.write_perm);

    attrMd.vloc    = BLE_GATTS_VLOC_STACK;
    attrMd.rd_auth = 0;
    attrMd.wr_auth = 0;
    attrMd.vlen    = 1;

    memset(&attr, 0, sizeof(ble_gatts_attr_t));
    attr.p_uuid    = &uuid;
    attr.p_attr_md = &attrMd;
    attr.init_len  = sizeof(uint8_t);
    attr.init_offs = 0;
    attr.max_len   = OT_BLE_CHARACTERISTIC_MAX_LENGTH;
    attr.p_value   = NULL;

    retval = sd_ble_gatts_characteristic_add(aServiceHandle, &charMd, &attr, &handles);

    if (retval != NRF_SUCCESS)
    {
        otLogWarnPlat("[BLE] sd_ble_gatts_characteristic_add error: 0x%x", retval);
    }
    else
    {
        aChar->mHandleValue = handles.value_handle;
        aChar->mHandleCccd  = handles.cccd_handle;
    }

exit:
    return nrf5SdErrorToOtError(retval);
}

static otError bleGattServerServicesRegister(otInstance *aInstance, otPlatBleGattService *aServices)
{
    (void)aInstance;

    otError                      error = OT_ERROR_NONE;
    otPlatBleGattCharacteristic *chr;

    while (aServices && (aServices->mUuid.mType != OT_BLE_UUID_TYPE_NONE))
    {
        error = serviceRegister(&aServices->mUuid, &aServices->mHandle);
        otEXPECT(error == OT_ERROR_NONE);

        chr = aServices->mCharacteristics;

        while (chr && (chr->mUuid.mType != OT_BLE_UUID_TYPE_NONE))
        {
            error = characteristicRegister(aServices->mHandle, chr, true);
            otEXPECT(error == OT_ERROR_NONE);

            chr++;
        }

        aServices += sizeof(otPlatBleGattService);
    }

exit:
    return nrf5SdErrorToOtError(error);
}

void otPlatTobleC2Indicate(otInstance *aInstance, otTobleConnection *aConn, const void *aBuffer, uint16_t aLength)
{
    uint32_t               retval;
    ble_gatts_hvx_params_t params;
    BlePeer *              peer = (BlePeer *)aConn;

    OT_UNUSED_VARIABLE(aInstance);

    // TODO: Gatt Server should also take the connection id.

    memset(&params, 0, sizeof(ble_gatts_hvx_params_t));
    params.handle = sBle.mC2Handle;
    params.p_data = aBuffer;
    params.p_len  = &aLength;
#if OPENTHREAD_CONFIG_TOBLE_BTP_NO_GATT_ACK
    params.type = BLE_GATT_HVX_NOTIFICATION;
#else
    params.type     = BLE_GATT_HVX_INDICATION;
#endif

    otLogInfoPlat("[BLE] otPlatTobleC2Indicate(ConnectionId=%d)", peer->mConnHandle);
    retval = sd_ble_gatts_hvx(peer->mConnHandle, &params);

    if (retval != NRF_SUCCESS)
    {
        otLogWarnPlat("[BLE] sd_ble_gatts_hvx error: 0x%x", retval);
    }

    return;
}

/****************************************************************************
 * @section Bluetooth Low Energy L2CAP Connection Oriented Channels.
 ***************************************************************************/

uint32_t bleL2capSendConnectionRequest(BlePeer *aPeer, uint16_t aPsm, uint16_t aMtu)
{
    uint32_t                    retval;
    ble_l2cap_ch_setup_params_t params;

    otEXPECT_ACTION(aMtu <= BLE_DEFAULT_L2CAP_MAX_MTU_SIZE, retval = NRF_ERROR_INVALID_PARAM);

    memset(&params, 0, sizeof(ble_l2cap_ch_setup_params_t));
    params.le_psm                   = aPsm;
    params.rx_params.rx_mtu         = aMtu;
    params.rx_params.rx_mps         = BLE_DEFAULT_L2CAP_MPS_SIZE;
    params.rx_params.sdu_buf.p_data = NULL;
    params.rx_params.sdu_buf.len    = 0;

