wgtdkp/openthread/examples/platforms/nrf528xx/src/toble.c
    retval = sd_ble_l2cap_ch_setup(aPeer->mConnHandle, &aPeer->mLocalCid, &params);

    if (retval != NRF_SUCCESS)
    {
        otLogWarnPlat("[BLE] sd_ble_l2cap_ch_setup error: 0x%x", retval);
    }

exit:
    return retval;
}

uint32_t bleL2capSendConnectionResponse(BlePeer *aPeer, otPlatBleL2capError aError, uint16_t aMtu)
{
    uint32_t                    retval;
    ble_l2cap_ch_setup_params_t params;

    otEXPECT_ACTION(aMtu <= BLE_DEFAULT_L2CAP_MAX_MTU_SIZE, retval = NRF_ERROR_INVALID_PARAM);

    memset(&params, 0, sizeof(ble_l2cap_ch_setup_params_t));
    params.le_psm                   = 0x0055; // TODO: PSM here?
    params.status                   = aError;
    params.rx_params.rx_mtu         = aMtu;
    params.rx_params.rx_mps         = BLE_DEFAULT_L2CAP_MPS_SIZE;
    params.rx_params.sdu_buf.p_data = NULL;
    params.rx_params.sdu_buf.len    = 0;

    retval = sd_ble_l2cap_ch_setup(aPeer->mConnHandle, &aPeer->mLocalCid, &params);

    if (retval != NRF_SUCCESS)
    {
        otLogWarnPlat("[BLE] sd_ble_l2cap_ch_setup error: 0x%x", retval);
    }

exit:
    return retval;
}

otError otPlatTobleL2capSend(otInstance *aInstance, otTobleConnection *aConn, const uint8_t *aBuffer, uint16_t aLength)
{
    BlePeer *  peer = (BlePeer *)aConn;
    uint32_t   retval;
    ble_data_t sduBuf;

    sduBuf.p_data = (uint8_t *)aBuffer;
    sduBuf.len    = aLength;

    retval = sd_ble_l2cap_ch_tx(peer->mConnHandle, peer->mLocalCid, &sduBuf);

    if (retval != NRF_SUCCESS)
    {
        otLogWarnPlat("[BLE] sd_ble_l2cap_ch_tx error: 0x%x", retval);
    }

    return nrf5SdErrorToOtError(retval);
}

/*******************************************************************************
 * @section SoftDevice events.
 *******************************************************************************/

bool nrf5SoftDeviceBleIsEnabled()
{
    return sBle.mState != kStateUninitialized;
}

static otError advReportTypeConvert(ble_gap_adv_report_type_t aSdAdvType, otTobleAdvType *aTobleAdvType)
{
    otError error = OT_ERROR_NONE;

    if (aSdAdvType.connectable && aSdAdvType.scannable && !aSdAdvType.directed)
    {
        *aTobleAdvType = OT_TOBLE_ADV_IND;
    }
    else if (aSdAdvType.connectable && !aSdAdvType.scannable && aSdAdvType.directed)
    {
        *aTobleAdvType = OT_TOBLE_ADV_DIRECT_IND;
    }
    else if (!aSdAdvType.connectable && aSdAdvType.scannable && !aSdAdvType.directed)
    {
        *aTobleAdvType = OT_TOBLE_ADV_SCAN_IND;
    }
    else if (!aSdAdvType.connectable && !aSdAdvType.scannable && !aSdAdvType.directed)
    {
        *aTobleAdvType = OT_TOBLE_ADV_NONCONN_IND;
    }
    else
    {
        error = OT_ERROR_FAILED;
    }

    return error;
}

uint32_t bleGattcCharValueByUuidRead(uint16_t                  aConnectionId,
                                     ble_gattc_handle_range_t *aRange,
                                     const otPlatBleUuid *     aOtUuid)
{
    ble_uuid_t uuid;

    uuidDecode(&uuid, aOtUuid);
    return sd_ble_gattc_char_value_by_uuid_read(aConnectionId, &uuid, aRange);
}

#if (OPENTHREAD_CONFIG_LOG_LEVEL >= OT_LOG_LEVEL_NOTE) && (OPENTHREAD_CONFIG_LOG_PLATFORM == 1)
static const char *bleEvtToString(int aEvtId)
{
    const char *str = "unknown";

    switch (aEvtId)
    {
    case BLE_GAP_EVT_CONNECTED:
        str = "BLE_GAP_EVT_CONNECTED";
        break;
    case BLE_GAP_EVT_DISCONNECTED:
        str = "BLE_GAP_EVT_DISCONNECTED";
        break;
    case BLE_GAP_EVT_CONN_PARAM_UPDATE:
        str = "BLE_GAP_EVT_CONN_PARAM_UPDATE";
        break;
    case BLE_GATTS_EVT_SYS_ATTR_MISSING:
        str = "BLE_GATTS_EVT_SYS_ATTR_MISSING";
        break;
    case BLE_GAP_EVT_SEC_PARAMS_REQUEST:
        str = "BLE_GAP_EVT_SEC_PARAMS_REQUEST";
        break;
    case BLE_GAP_EVT_ADV_REPORT:
        str = "BLE_GAP_EVT_ADV_REPORT";
        break;
    case BLE_GAP_EVT_TIMEOUT:
        str = "BLE_GAP_EVT_TIMEOUT";
        break;
    case BLE_GAP_EVT_RSSI_CHANGED:
        str = "BLE_GAP_EVT_RSSI_CHANGED";
        break;
    case BLE_GAP_EVT_DATA_LENGTH_UPDATE:
        str = "BLE_GAP_EVT_DATA_LENGTH_UPDATE";
        break;
    case BLE_GAP_EVT_DATA_LENGTH_UPDATE_REQUEST:
        str = "BLE_GAP_EVT_DATA_LENGTH_UPDATE_REQUEST";
        break;
    case BLE_GATTS_EVT_EXCHANGE_MTU_REQUEST:
        str = "BLE_GATTS_EVT_EXCHANGE_MTU_REQUEST";
        break;
    case BLE_GATTS_EVT_WRITE:
        str = "BLE_GATTS_EVT_WRITE";
        break;
    case BLE_GATTS_EVT_HVN_TX_COMPLETE:
        str = "BLE_GATTS_EVT_HVN_TX_COMPLETE";
        break;
    case BLE_GATTS_EVT_HVC:
        str = "BLE_GATTS_EVT_HVC";
        break;
    case BLE_GATTS_EVT_TIMEOUT:
        str = "BLE_GATTS_EVT_TIMEOUT";
        break;
    case BLE_GATTC_EVT_EXCHANGE_MTU_RSP:
        str = "BLE_GATTC_EVT_EXCHANGE_MTU_RSP";
        break;
    case BLE_GATTC_EVT_TIMEOUT:
        str = "BLE_GATTC_EVT_TIMEOUT";
        break;
    case BLE_GATTC_EVT_HVX:
        str = "BLE_GATTC_EVT_HVX";
        break;
    case BLE_GATTC_EVT_WRITE_CMD_TX_COMPLETE:
        str = "BLE_GATTC_EVT_WRITE_CMD_TX_COMPLETE";
        break;
    case BLE_GATTC_EVT_WRITE_RSP:
        str = "BLE_GATTC_EVT_WRITE_RSP";
        break;
    case BLE_GATTC_EVT_PRIM_SRVC_DISC_RSP:
        str = "BLE_GATTC_EVT_PRIM_SRVC_DISC_RSP";
        break;
    case BLE_GATTC_EVT_CHAR_VAL_BY_UUID_READ_RSP:
        str = "BLE_GATTC_EVT_CHAR_VAL_BY_UUID_READ_RSP";
        break;
    }

    return str;
}
#endif //#if (OPENTHREAD_CONFIG_LOG_LEVEL >= OT_LOG_LEVEL_DEBG) && (OPENTHREAD_CONFIG_LOG_PLATFORM == 1)

static void ble_evt_handler(ble_evt_t const *aEvent, void *aContext)
{
    uint32_t   retval       = NRF_SUCCESS;
    ble_evt_t *evt          = (ble_evt_t *)aEvent;
    uint16_t   connectionId = evt->evt.common_evt.conn_handle;
    BlePeer *  peer;

    OT_UNUSED_VARIABLE(aContext);

    otEXPECT(nrf5SoftDeviceBleIsEnabled());

    if (evt->header.evt_id != BLE_GAP_EVT_ADV_REPORT)
    {
        otLogInfoPlat("[BLE] Event: ConnectionId=%d %s", connectionId, bleEvtToString(evt->header.evt_id));
    }

    switch (evt->header.evt_id)
    {
    case BLE_GAP_EVT_CONNECTED:
    {
        sBle.mState = kStateIdle;

        peer = (sPeripheralPeer != NULL) ? sPeripheralPeer : peerAllocate();
        if (peer == NULL)
        {
            sd_ble_gap_disconnect(connectionId, OT_BLE_HCI_REMOTE_USER_TERMINATED);
            break;
        }

        peer->mConnHandle = connectionId;
        if (sDiagMode)
        {
            otPlatTobleDiagHandleConnected(sInstance, (otTobleConnection *)peer);
        }
        else
        {
            otPlatTobleHandleConnected(sInstance, (otTobleConnection *)peer);
        }

