wgtdkp/openthread/examples/platforms/nrf528xx/src/toble.c
    case BLE_GATTS_EVT_WRITE:
    {
        ble_gatts_evt_write_t *evtWrite = &evt->evt.gatts_evt.params.write;
        otBleRadioPacket       packet;
        uint8_t                channel_index;

        retval = sd_ble_gap_rssi_get(connectionId, &packet.mPower, &channel_index);

        if (retval != NRF_SUCCESS)
        {
            otLogWarnPlat("[BLE] sd_ble_gap_rssi_get error: 0x%x", retval);
            packet.mPower = 0;
        }

        packet.mValue  = evtWrite->data;
        packet.mLength = evtWrite->len;

        if ((peer = peerFind(connectionId)) != NULL)
        {
            peer->mLinkType = kConnectionLinkTypeGatt;

            if (packet.mLength == 2 && isCccdHandle(evtWrite->handle))
            {
                uint16_t cccd = packet.mValue[0] | (packet.mValue[1] << 8);
#if OPENTHREAD_CONFIG_TOBLE_BTP_NO_GATT_ACK
                bool subscribed = (cccd & BLE_GATT_HVX_NOTIFICATION) > 0;
#else
                bool subscribed = (cccd & BLE_GATT_HVX_INDICATION) > 0;
#endif

                if (sDiagMode)
                {
                    otPlatTobleDiagHandleC2Subscribed(sInstance, (otTobleConnection *)peer, subscribed);
                }
                else
                {
                    otPlatTobleHandleC2Subscribed(sInstance, (otTobleConnection *)peer, subscribed);
                }
            }
            else
            {
                if (sDiagMode)
                {
                    otPlatTobleDiagHandleC1Write(sInstance, (otTobleConnection *)peer, evtWrite->data, evtWrite->len);
                }
                else
                {
                    otPlatTobleHandleC1Write(sInstance, (otTobleConnection *)peer, evtWrite->data, evtWrite->len);
                }
            }
        }

        break;
    }

    case BLE_GATTS_EVT_HVN_TX_COMPLETE:
    {
        ble_gatts_evt_hvn_tx_complete_t *evtHvn = &evt->evt.gatts_evt.params.hvn_tx_complete;
        otLogDebgPlat("[BLE] BLE_GATTS_EVT_HVN_TX_COMPLETE: count=%d", connectionId, evtHvn->count);
        OT_UNUSED_VARIABLE(evtHvn);
    }
        // Fall through

    case BLE_GATTS_EVT_HVC:
    {
        if ((peer = peerFind(connectionId)) != NULL)
        {
            if (sDiagMode)
            {
                otPlatTobleDiagHandleC2IndicateDone(sInstance, (otTobleConnection *)peer);
            }
            else
            {
                otPlatTobleHandleC2IndicateDone(sInstance, (otTobleConnection *)peer);
            }
        }
        break;
    }

    case BLE_GATTS_EVT_TIMEOUT:
        sd_ble_gap_disconnect(connectionId, OT_BLE_HCI_REMOTE_USER_TERMINATED);
        break;

    case BLE_GATTC_EVT_EXCHANGE_MTU_RSP:
    {
        ble_gattc_evt_exchange_mtu_rsp_t *evtMtu = &evt->evt.gattc_evt.params.exchange_mtu_rsp;

        if ((peer = peerFind(connectionId)) != NULL)
        {
            ble_uuid_t uuid;

            otLogDebgPlat("[BLE] BLE_GATTC_EVT_EXCHANGE_MTU_RSP, mAttMtu=%d, server_rx_mtu=%d", peer->mAttMtu,
                          evtMtu->server_rx_mtu);

            peer->mAttMtu = MIN(peer->mAttMtu, evtMtu->server_rx_mtu);

            retval = uuidDecode(&uuid, &sBtpServices[0].mUuid);
            otEXPECT(retval == NRF_SUCCESS);

            if (sd_ble_gattc_primary_services_discover(peer->mConnHandle, BLE_GATT_HANDLE_START, &uuid) != NRF_SUCCESS)
            {
                otLogWarnPlat("[BLE] sd_ble_gattc_primary_services_discover error: 0x%x", retval);
            }
        }
        break;
    }

    case BLE_GATTC_EVT_TIMEOUT:
        sd_ble_gap_disconnect(connectionId, OT_BLE_HCI_REMOTE_USER_TERMINATED);
        break;

    case BLE_GATTC_EVT_HVX:
    {
        ble_gattc_evt_hvx_t *evtHvx = &evt->evt.gattc_evt.params.hvx;

        retval = sd_ble_gattc_hv_confirm(connectionId, evtHvx->handle);
        if (retval != NRF_SUCCESS)
        {
            otLogWarnPlat("[BLE] sd_ble_gattc_hv_confirm error: 0x%x", retval);
        }

        if ((peer = peerFind(connectionId)) != NULL)
        {
            if (sDiagMode)
            {
                otPlatTobleDiagHandleC2Indication(sInstance, (otTobleConnection *)peer, evtHvx->data, evtHvx->len);
            }
            else
            {
                otPlatTobleHandleC2Indication(sInstance, (otTobleConnection *)peer, evtHvx->data, evtHvx->len);
            }
        }
        break;
    }

    case BLE_GATTC_EVT_WRITE_CMD_TX_COMPLETE:
    {
        ble_gattc_evt_write_cmd_tx_complete_t *evtWcmd = &evt->evt.gattc_evt.params.write_cmd_tx_complete;
        otLogDebgPlat("[BLE] BLE_GATTC_EVT_WRITE_CMD_TX_COMPLETE: count=%d", evtWcmd->count);
        OT_UNUSED_VARIABLE(evtWcmd);
    }
        // Fall through

    case BLE_GATTC_EVT_WRITE_RSP:
    {
        if (sBle.mState != kStateGattSubscribing)
        {
            if ((peer = peerFind(connectionId)) != NULL)
            {
                if (sDiagMode)
                {
                    otPlatTobleDiagHandleC1WriteDone(sInstance, (otTobleConnection *)peer);
                }
                else
                {
                    otPlatTobleHandleC1WriteDone(sInstance, (otTobleConnection *)peer);
                }
            }
        }

        sBle.mState = kStateIdle;

        break;
    }

    case BLE_GATTC_EVT_PRIM_SRVC_DISC_RSP:
    {
        ble_gattc_evt_prim_srvc_disc_rsp_t *evtDisc = &evt->evt.gattc_evt.params.prim_srvc_disc_rsp;

        if (evtDisc->count == 1)
        {
            sBle.mServiceHandleRange = evtDisc->services[0].handle_range;
            sBle.mState              = kStateGattiDiscoverUuidC1Handle;

            otLogDebgPlat("[BLE] BLE_GATTC_EVT_PRIM_SRVC_DISC_RSP, start_handle=%d end_handle=%d",
                          sBle.mServiceHandleRange.start_handle, sBle.mServiceHandleRange.end_handle);
            bleGattcCharValueByUuidRead(connectionId, &sBle.mServiceHandleRange,
                                        &sBtpServices[0].mCharacteristics[0].mUuid);
        }
        else
        {
            otLogDebgPlat("[BLE] BLE_GATTC_EVT_PRIM_SRVC_DISC_RSP, Not Found");
        }

        break;
    }
    case BLE_GATTC_EVT_CHAR_VAL_BY_UUID_READ_RSP:
    {
        ble_gattc_evt_char_val_by_uuid_read_rsp_t *evtDisc = &evt->evt.gattc_evt.params.char_val_by_uuid_read_rsp;

        if (sBle.mState == kStateGattiDiscoverUuidC1Handle)
        {
            otLogDebgPlat("[BLE] BLE_GATTC_EVT_CHAR_VAL_BY_UUID_READ_RSP, count=%d value_len=%d UuidC1Handle=%d",
                          evtDisc->count, evtDisc->value_len, evtDisc->handle_value[0]);
            sBle.mState    = kStateGattiDiscoverUuidC2Handle;
            sBle.mC1Handle = evtDisc->handle_value[0];

            bleGattcCharValueByUuidRead(connectionId, &sBle.mServiceHandleRange,
                                        &sBtpServices[0].mCharacteristics[1].mUuid);
        }
        else if (sBle.mState == kStateGattiDiscoverUuidC2Handle)
        {
            otPlatBleUuid uuid = {.mType = OT_BLE_UUID_TYPE_16, .mValue.mUuid16 = OT_BLE_UUID_CCCD};

