wgtdkp/openthread/examples/platforms/nrf528xx/src/toble.c
OT_TOOL_WEAK void otPlatTobleHandleC2IndicateDone(otInstance *aInstance, otTobleConnection *aConn)
{
    OT_UNUSED_VARIABLE(aInstance);
    OT_UNUSED_VARIABLE(aConn);
}

OT_TOOL_WEAK void otPlatTobleHandleC1Write(otInstance *       aInstance,
                                           otTobleConnection *aConn,
                                           const uint8_t *    aBuffer,
                                           uint16_t           aLength)
{
    OT_UNUSED_VARIABLE(aInstance);
    OT_UNUSED_VARIABLE(aConn);
    OT_UNUSED_VARIABLE(aBuffer);
    OT_UNUSED_VARIABLE(aLength);
}

OT_TOOL_WEAK void otPlatTobleL2capSendDone(otInstance *aInstance, otTobleConnection *aConn)
{
    OT_UNUSED_VARIABLE(aInstance);
    OT_UNUSED_VARIABLE(aConn);
}

OT_TOOL_WEAK void otPlatTobleL2CapFrameReceived(otInstance *       aInstance,
                                                otTobleConnection *aConn,
                                                const uint8_t *    aBuffer,
                                                uint16_t           aLength)
{
    OT_UNUSED_VARIABLE(aInstance);
    OT_UNUSED_VARIABLE(aConn);
    OT_UNUSED_VARIABLE(aBuffer);
    OT_UNUSED_VARIABLE(aLength);
}

//---------------------------

OT_TOOL_WEAK void otPlatTobleDiagGapOnAdvReceived(otInstance *      aInstance,
                                                  otTobleAdvType    aAdvType,
                                                  otTobleAdvPacket *aAdvPacket)
{
    OT_UNUSED_VARIABLE(aInstance);
    OT_UNUSED_VARIABLE(aAdvPacket);
}

OT_TOOL_WEAK void otPlatTobleDiagGapOnScanRespReceived(otInstance *aInstance, otTobleAdvPacket *aAdvPacket)
{
    OT_UNUSED_VARIABLE(aInstance);
    OT_UNUSED_VARIABLE(aAdvPacket);
}

OT_TOOL_WEAK void otPlatTobleDiagHandleConnected(otInstance *aInstance, otTobleConnection *aConn)
{
    OT_UNUSED_VARIABLE(aInstance);
    OT_UNUSED_VARIABLE(aConn);
}

OT_TOOL_WEAK void otPlatTobleDiagHandleDisconnected(otInstance *aInstance, otTobleConnection *aConn)
{
    OT_UNUSED_VARIABLE(aInstance);
    OT_UNUSED_VARIABLE(aConn);
}

OT_TOOL_WEAK void otPlatTobleDiagHandleConnectionIsReady(otInstance *              aInstance,
                                                         otTobleConnection *       aConn,
                                                         otTobleConnectionLinkType aLinkType)
{
    OT_UNUSED_VARIABLE(aInstance);
    OT_UNUSED_VARIABLE(aConn);
    OT_UNUSED_VARIABLE(aLinkType);
}

OT_TOOL_WEAK void otPlatTobleDiagHandleC1WriteDone(otInstance *aInstance, otTobleConnection *aConn)
{
    OT_UNUSED_VARIABLE(aInstance);
    OT_UNUSED_VARIABLE(aConn);
}

OT_TOOL_WEAK void otPlatTobleDiagHandleC2Indication(otInstance *       aInstance,
                                                    otTobleConnection *aConn,
                                                    const uint8_t *    aBuffer,
                                                    uint16_t           aLength)
{
    OT_UNUSED_VARIABLE(aInstance);
    OT_UNUSED_VARIABLE(aConn);
    OT_UNUSED_VARIABLE(aBuffer);
    OT_UNUSED_VARIABLE(aLength);
}

OT_TOOL_WEAK void otPlatTobleDiagHandleC2Subscribed(otInstance *aInstance, otTobleConnection *aConn, bool aIsSubscribed)
{
    OT_UNUSED_VARIABLE(aInstance);
    OT_UNUSED_VARIABLE(aConn);
    OT_UNUSED_VARIABLE(aIsSubscribed);
}

OT_TOOL_WEAK void otPlatTobleDiagHandleC2IndicateDone(otInstance *aInstance, otTobleConnection *aConn)
{
    OT_UNUSED_VARIABLE(aInstance);
    OT_UNUSED_VARIABLE(aConn);
}

OT_TOOL_WEAK void otPlatTobleDiagHandleC1Write(otInstance *       aInstance,
                                               otTobleConnection *aConn,
                                               const uint8_t *    aBuffer,
                                               uint16_t           aLength)
{
    OT_UNUSED_VARIABLE(aInstance);
    OT_UNUSED_VARIABLE(aConn);
    OT_UNUSED_VARIABLE(aBuffer);
    OT_UNUSED_VARIABLE(aLength);
}

OT_TOOL_WEAK void otPlatTobleDiagL2capSendDone(otInstance *aInstance, otTobleConnection *aConn)
{
    OT_UNUSED_VARIABLE(aInstance);
    OT_UNUSED_VARIABLE(aConn);
}

OT_TOOL_WEAK void otPlatTobleDiagL2CapFrameReceived(otInstance *       aInstance,
                                                    otTobleConnection *aConn,
                                                    const uint8_t *    aBuffer,
                                                    uint16_t           aLength)
{
    OT_UNUSED_VARIABLE(aInstance);
    OT_UNUSED_VARIABLE(aConn);
    OT_UNUSED_VARIABLE(aBuffer);
    OT_UNUSED_VARIABLE(aLength);
}

#endif // #if OPENTHREAD_CONFIG_TOBLE_ENABLE && SOFTDEVICE_PRESENT
